Repository: Distrotech/gss
Catalog: po/*.po
Languages: ro

source: A required input parameter could not be read
ro: Nu a putut fi citit un parametru de intrare obligatoriu

source: A required output parameter could not be written
ro: Nu a putut fi scris un parametru de ieºire obligatoriu

source: A parameter was malformed
ro: Un parametru a fost incorect

source: An unsupported mechanism was requested
ro: A fost cerut un mecanism care nu este suportat

source: An invalid name was supplied
ro: A fost furnizat un nume invalid

source: A supplied name was of an unsupported type
ro: Un nume furnizat a fost de un tip care nu este suportat

source: Incorrect channel bindings were supplied
ro: Au for furnizate legãturi de canale incorecte

source: An invalid status code was supplied
ro: A fost furnizat un cod de stare invalid

source: A token had an invalid MIC
ro: Un token a avut un MIC invalid

source: No credentials were supplied, or the credentials were unavailable or inaccessible
ro: Nici o legitimaþie (credential) nu a fost furnizatã, sau legitimaþiile nu au fost disponibile sau inaccesibile

source: No context has been established
ro: Nici un context nu a fost stabilit

source: A token was invalid
ro: Un token a fost invalid

source: A credential was invalid
ro: O legitimaþie (credential) a fost invalidã

source: The referenced credentials have expired
ro: Legitimaþiile (credentials) referite au expirat

source: The context has expired
ro: Contextul a expirat

source: Unspecified error in underlying mechanism
ro: O eraoare nespecificatã în mecanismul subiacent

source: The quality-of-protection requested could not be provided
ro: Calitatea-de-protecþie cerutã nu a putut fi furnizatã

source: The operation is forbidden by local security policy
ro: Operaþia este interzisã de politica de securitate localã

source: The operation or option is unavailable
ro: Operaþia sau opþiunea nu este disponibilã

source: The requested credential element already exists
ro: Elementul de legitimare (credential) cerut existã deja

source: The provided name was not a mechanism name
ro: Numele furnizat nu a fost un nume de mecanism

source: The gss_init_sec_context() or gss_accept_sec_context() function must be called again to complete its function
ro: Funcþiile gss_init_sec_context() sau gss_accept_sec_context() trebuie chemate din nou pentru a-ºi îndeplini funcþia

source: The token was a duplicate of an earlier token
ro: Token-ul a fost un duplicat al unui token anterior

source: The token's validity period has expired
ro: Perioada de validitate a token-ului a expirat

source: A later token has already been processed
ro: Un token ulterior a fost deja procesat

source: An expected per-message token was not received
ro: Un token pe mesaj aºteptat nu a fost primit

source: No error
ro: Nici o eroare

source: No @ in SERVICE-NAME name string
ro: Nici un @ în numele SERVICE-NAME

source: STRING-UID-NAME contains nondigits
ro: STRING-UID-NAME conþine non-cifre

source: UID does not resolve to username
ro: UID nu este rezolvat ca username (nume utilizator)

source: Validation error
ro: Eroare de validare

source: Couldn't allocate gss_buffer_t data
ro: Nu am putut aloca data gss_buffer_t

source: Message context invalid
ro: Context mesaj invalid

source: Buffer is the wrong size
ro: Buffer-ul este de dimensiune incorectã

source: Credential usage type is unknown
ro: Tipul de folosire a legitimaþiei este necunoscut

source: Unknown quality of protection specified
ro: Calitate de protecþie specificatã necunoscutã

source: Principal in credential cache does not match desired name
ro: Principalul în cache-ul de legitimaþii nu se potriveºte cu numele dorit

source: No principal in keytab matches desired name
ro: Nici un principal în keytab nu se potriveºte cu numele dorit

source: Credential cache has no TGT
ro: Cache-ul de legitimaþii (credentials) nu are nici un TGT

source: Authenticator has no subkey
ro: Authenticator-u nu are nici o subcheie

source: Context is already fully established
ro: Contextul este deja stabilit în totalitate

source: Unknown signature type in token
ro: Tip de semnãturã necunoscut în token

source: Invalid field length in token
ro: Lungimea câmpuui invalidã în token

source: Attempt to use incomplete security context
ro: Încercare de folosire a unui context de securitate incomplet

source: No krb5 error
ro: Nici o eroare krb5

source: Unknown krb5 error
ro: Eroare krb5 necunoscutã

source: %s: missing parameter
ro: %s: parametru lipsã

source: Try `%s --help' for more information.
ro: Încercaþi `%s --help' pentru informaþii suplimentare.

source: GSS-API major status code %ld (0x%lx).
ro: Cod de stare GSS-API major %ld (0x%lx).

source: MSB LSB +-----------------+-----------------+---------------------------------+ | Calling Error | Routine Error | Supplementary Info | |
ro: MSB LSB +-----------------+-----------------+---------------------------------+ | Eroare Apel | Eroare Rutinã | Informaþii Suplimentare | |

source: Masked routine error %ld (0x%lx) shifted into %ld (0x%lx):
ro: Eroare rutinã mascatã %ld (0x%lx) shiftatã în %ld (0x%lx):

source: %s: displaying status code failed
ro: %s: afiºarea codului de stare a eºuat

source: Masked calling error %ld (0x%lx) shifted into %ld (0x%lx):
ro: Eroare apel mascatã %ld (0x%lx) shiftatã în %ld (0x%lx):

source: Masked supplementary info %ld (0x%lx) shifted into %ld (0x%lx):
ro: Informaþia suplimentarã mascatã %ld (0x%lx) shiftatã în %ld (0x%lx):

source: No error
ro: Nici o eroare
